{"title":"DYSJUNCT","description":"Your favorite technology blog for songs, movies, services and more","language":"en","link":"https://dysjunct.tk","pubDate":"Wed, 07 Sep 2022 15:16:52 GMT","lastBuildDate":"Wed, 07 Sep 2022 15:52:57 GMT","generator":"hexo-generator-json-feed","webMaster":"Debby Sant","items":[{"title":"The Best Tech Songs for Every Developer","link":"https://dysjunct.tk/2022/09/07/Blog-Technology-Entertainment/The-Best-Tech-Songs-for-Every-Developer.html","description":"Coding is the ultimate mind exercise, it involves extreme attention to detail and a whole lot of critical thinking. Listening to music can greatly help, with its ability to motivate and relax the mind, it’s the perfect companion for coding. Next time you’re working on a coding project, here are 9 songs to get you “In the zone.” Let’s beginHalo Theme – Martin O’ DonnellThere are several variations of this song, but the Halo 2 menu screen is iconic. The chants in this song are especially helpful during those intense coding situations. Techno Syndrome (Mortal Kombat) – The ImmortalsThe Immortals became, well, immortal, with their 1999 techno hit. Try listening to this song the next time you’re working on your video game. Go Robot – The Red Hot Chili PeppersYou can relate to this feeling when learning a new technology, coding requires you to be synchronized with the computer in order to find your flow. Funkentelechy – ParliamentBernie Worrell’s galactic synth combined with Bootsy Collins’ space blaster-like bass make this song a powerful weapon against the coding blues. Spaceship Earth ThemeThe score to this iconic EPCOT attraction evokes images of evolving technology and makes us realize our place as coders, in the history of communication. Halcyon On and On – OrbitalThis song starts off slow and eventually comes to an uplifting beat perfect for putting together long sequences. The vocal tracks have an almost soothing effect, which can help during stressful times behind the keyboard. Derezzed from Tron Legacy Soundtrack – Daft PunkIf you’ve ever stared at the screen so long you felt like you were going to fall in, you’re probably a coder. If you’ve ever actually fallen into the computer, then you’re a member of the Flynn family. Love Game – Lady GagaLady Gaga knows how to make a catchy song, and once this beat enters your brain, you’ll be inspired to take your coding to higher levels of creativity. Master of Puppets – MetallicaWhether you’re changing the layout of a website, programming a robot, or animating a sprite for a video game, one fact remains; you are the Master! Music tastes vary, with people’s cordial preferences different from others. But that’s one of the great things about coding, we’re all inspired by different aspects of life to begin learning. Try listening to a wide variety of music, that way you’re guaranteed to have a full arsenal of songs for tackling any coding problems you have in the future.","pubDate":"Wed, 07 Sep 2022 15:16:52 GMT","guid":"https://dysjunct.tk/2022/09/07/Blog-Technology-Entertainment/The-Best-Tech-Songs-for-Every-Developer.html","category":"Blog, Technology, Entertainment"},{"title":"The Best Tech Movies for Developers","link":"https://dysjunct.tk/2022/06/02/Blog-Technology-Entertainment/The-Best-Tech-Movies-for-Developers.html","description":"Every programmer would love to see their profession from the perspective of movies. We all know Hollywood is well known in showcasing programming and Artificial Intelligence in the right ways. Here are the 10 best movies that every programmer must watch.","pubDate":"Fri, 03 Jun 2022 01:42:29 GMT","guid":"https://dysjunct.tk/2022/06/02/Blog-Technology-Entertainment/The-Best-Tech-Movies-for-Developers.html","category":"Blog, Technology, Entertainment"},{"title":"The Tech Uniform for every developer","link":"https://dysjunct.tk/2022/06/02/Blog-Technology-Entertainment/The-Tech-Uniform-for-every-developer.html","description":"In the streets of San Francisco on an all-too-warm afternoon, scouting for people wearing what I thought of as the “tech uniform” - the studiedly casual California look associated with startup culture. You know the look, that company T-shirt, jeans, and the omnipresent hoodie.","pubDate":"Fri, 03 Jun 2022 00:04:18 GMT","guid":"https://dysjunct.tk/2022/06/02/Blog-Technology-Entertainment/The-Tech-Uniform-for-every-developer.html","category":"Blog, Technology, Entertainment"}]}